MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32MC204/mcu.h
#define _P2DTCON1_DTB_POSITION                   0x00000008
#define _P2DTCON1_DTB_MASK                       0x00003F00
#define _P2DTCON1_DTB_LENGTH                     0x00000006

#define _P2DTCON1_DTBPS_POSITION                 0x0000000E
#define _P2DTCON1_DTBPS_MASK                     0x0000C000
#define _P2DTCON1_DTBPS_LENGTH                   0x00000002

#define _P2DTCON1_DTA0_POSITION                  0x00000000
#define _P2DTCON1_DTA0_MASK                      0x00000001
#define _P2DTCON1_DTA0_LENGTH                    0x00000001

#define _P2DTCON1_DTA1_POSITION                  0x00000001
#define _P2DTCON1_DTA1_MASK                      0x00000002
#define _P2DTCON1_DTA1_LENGTH                    0x00000001

#define _P2DTCON1_DTA2_POSITION                  0x00000002
#define _P2DTCON1_DTA2_MASK                      0x00000004
#define _P2DTCON1_DTA2_LENGTH                    0x00000001

#define _P2DTCON1_DTA3_POSITION                  0x00000003
#define _P2DTCON1_DTA3_MASK                      0x00000008
#define _P2DTCON1_DTA3_LENGTH                    0x00000001

#define _P2DTCON1_DTA4_POSITION                  0x00000004
#define _P2DTCON1_DTA4_MASK                      0x00000010
#define _P2DTCON1_DTA4_LENGTH                    0x00000001

#define _P2DTCON1_DTA5_POSITION                  0x00000005
#define _P2DTCON1_DTA5_MASK                      0x00000020
#define _P2DTCON1_DTA5_LENGTH                    0x00000001

#define _P2DTCON1_DTAPS0_POSITION                0x00000006
#define _P2DTCON1_DTAPS0_MASK                    0x00000040
#define _P2DTCON1_DTAPS0_LENGTH                  0x00000001

#define _P2DTCON1_DTAPS1_POSITION                0x00000007
#define _P2DTCON1_DTAPS1_MASK                    0x00000080
#define _P2DTCON1_DTAPS1_LENGTH                  0x00000001

#define _P2DTCON1_DTB0_POSITION                  0x00000008
#define _P2DTCON1_DTB0_MASK                      0x00000100
#define _P2DTCON1_DTB0_LENGTH                    0x00000001

#define _P2DTCON1_DTB1_POSITION                  0x00000009
#define _P2DTCON1_DTB1_MASK                      0x00000200
#define _P2DTCON1_DTB1_LENGTH                    0x00000001

#define _P2DTCON1_DTB2_POSITION                  0x0000000A
#define _P2DTCON1_DTB2_MASK                      0x00000400
#define _P2DTCON1_DTB2_LENGTH                    0x00000001

#define _P2DTCON1_DTB3_POSITION                  0x0000000B
#define _P2DTCON1_DTB3_MASK                      0x00000800
#define _P2DTCON1_DTB3_LENGTH                    0x00000001

#define _P2DTCON1_DTB4_POSITION                  0x0000000C
#define _P2DTCON1_DTB4_MASK                      0x00001000
#define _P2DTCON1_DTB4_LENGTH                    0x00000001

#define _P2DTCON1_DTB5_POSITION                  0x0000000D
#define _P2DTCON1_DTB5_MASK                      0x00002000
#define _P2DTCON1_DTB5_LENGTH                    0x00000001

#define _P2DTCON1_DTBPS0_POSITION                0x0000000E
#define _P2DTCON1_DTBPS0_MASK                    0x00004000
#define _P2DTCON1_DTBPS0_LENGTH                  0x00000001

#define _P2DTCON1_DTBPS1_POSITION                0x0000000F
#define _P2DTCON1_DTBPS1_MASK                    0x00008000
#define _P2DTCON1_DTBPS1_LENGTH                  0x00000001

#define _P2DTCON2_DTS1I_POSITION                 0x00000000
#define _P2DTCON2_DTS1I_MASK                     0x00000001
#define _P2DTCON2_DTS1I_LENGTH                   0x00000001

#define _P2DTCON2_DTS1A_POSITION                 0x00000001
#define _P2DTCON2_DTS1A_MASK                     0x00000002
#define _P2DTCON2_DTS1A_LENGTH                   0x00000001

#define _P2FLTACON_FAEN1_POSITION                0x00000000
#define _P2FLTACON_FAEN1_MASK                    0x00000001
#define _P2FLTACON_FAEN1_LENGTH                  0x00000001

#define _P2FLTACON_FLTAM_POSITION                0x00000007
#define _P2FLTACON_FLTAM_MASK                    0x00000080
#define _P2FLTACON_FLTAM_LENGTH                  0x00000001

#define _P2FLTACON_FAOV1L_POSITION               0x00000008
#define _P2FLTACON_FAOV1L_MASK                   0x00000100
#define _P2FLTACON_FAOV1L_LENGTH                 0x00000001

#define _P2FLTACON_FAOV1H_POSITION               0x00000009
#define _P2FLTACON_FAOV1H_MASK                   0x00000200
#define _P2FLTACON_FAOV1H_LENGTH                 0x00000001

#define _P2OVDCON_POUT1L_POSITION                0x00000000
#define _P2OVDCON_POUT1L_MASK                    0x00000001
#define _P2OVDCON_POUT1L_LENGTH                  0x00000001

#define _P2OVDCON_POUT1H_POSITION                0x00000001
#define _P2OVDCON_POUT1H_MASK                    0x00000002
#define _P2OVDCON_POUT1H_LENGTH                  0x00000001

#define _P2OVDCON_POVD1L_POSITION                0x00000008
#define _P2OVDCON_POVD1L_MASK                    0x00000100
#define _P2OVDCON_POVD1L_LENGTH                  0x00000001

#define _P2OVDCON_POVD1H_POSITION                0x00000009
#define _P2OVDCON_POVD1H_MASK                    0x00000200
#define _P2OVDCON_POVD1H_LENGTH                  0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x00001F00
#define _RPINR0_INT1R_LENGTH                     0x00000005

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

#define _RPINR0_INT1R2_POSITION                  0x0000000A
#define _RPINR0_INT1R2_MASK                      0x00000400
#define _RPINR0_INT1R2_LENGTH                    0x00000001

#define _RPINR0_INT1R3_POSITION                  0x0000000B
#define _RPINR0_INT1R3_MASK                      0x00000800
#define _RPINR0_INT1R3_LENGTH                    0x00000001

#define _RPINR0_INT1R4_POSITION                  0x0000000C
#define _RPINR0_INT1R4_MASK                      0x00001000
#define _RPINR0_INT1R4_LENGTH                    0x00000001

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x0000001F
#define _RPINR1_INT2R_LENGTH                     0x00000005

#define _RPINR1_INT2R0_POSITION                  0x00000000
#define _RPINR1_INT2R0_MASK                      0x00000001
#define _RPINR1_INT2R0_LENGTH                    0x00000001

#define _RPINR1_INT2R1_POSITION                  0x00000001
#define _RPINR1_INT2R1_MASK                      0x00000002
#define _RPINR1_INT2R1_LENGTH                    0x00000001

#define _RPINR1_INT2R2_POSITION                  0x00000002
#define _RPINR1_INT2R2_MASK                      0x00000004
#define _RPINR1_INT2R2_LENGTH                    0x00000001

#define _RPINR1_INT2R3_POSITION                  0x00000003
#define _RPINR1_INT2R3_MASK                      0x00000008
#define _RPINR1_INT2R3_LENGTH                    0x00000001

#define _RPINR1_INT2R4_POSITION                  0x00000004
#define _RPINR1_INT2R4_MASK                      0x00000010
#define _RPINR1_INT2R4_LENGTH                    0x00000001

