MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32MC204/mcu.h
#define _RPINR11_OCFAR2_POSITION                 0x00000002
#define _RPINR11_OCFAR2_MASK                     0x00000004
#define _RPINR11_OCFAR2_LENGTH                   0x00000001

#define _RPINR11_OCFAR3_POSITION                 0x00000003
#define _RPINR11_OCFAR3_MASK                     0x00000008
#define _RPINR11_OCFAR3_LENGTH                   0x00000001

#define _RPINR11_OCFAR4_POSITION                 0x00000004
#define _RPINR11_OCFAR4_MASK                     0x00000010
#define _RPINR11_OCFAR4_LENGTH                   0x00000001

#define _RPINR12_FLTA1R_POSITION                 0x00000000
#define _RPINR12_FLTA1R_MASK                     0x0000001F
#define _RPINR12_FLTA1R_LENGTH                   0x00000005

#define _RPINR12_FLTA1R0_POSITION                0x00000000
#define _RPINR12_FLTA1R0_MASK                    0x00000001
#define _RPINR12_FLTA1R0_LENGTH                  0x00000001

#define _RPINR12_FLTA1R1_POSITION                0x00000001
#define _RPINR12_FLTA1R1_MASK                    0x00000002
#define _RPINR12_FLTA1R1_LENGTH                  0x00000001

#define _RPINR12_FLTA1R2_POSITION                0x00000002
#define _RPINR12_FLTA1R2_MASK                    0x00000004
#define _RPINR12_FLTA1R2_LENGTH                  0x00000001

#define _RPINR12_FLTA1R3_POSITION                0x00000003
#define _RPINR12_FLTA1R3_MASK                    0x00000008
#define _RPINR12_FLTA1R3_LENGTH                  0x00000001

#define _RPINR12_FLTA1R4_POSITION                0x00000004
#define _RPINR12_FLTA1R4_MASK                    0x00000010
#define _RPINR12_FLTA1R4_LENGTH                  0x00000001

#define _RPINR13_FLTA2R_POSITION                 0x00000000
#define _RPINR13_FLTA2R_MASK                     0x0000001F
#define _RPINR13_FLTA2R_LENGTH                   0x00000005

#define _RPINR13_FLTA2R0_POSITION                0x00000000
#define _RPINR13_FLTA2R0_MASK                    0x00000001
#define _RPINR13_FLTA2R0_LENGTH                  0x00000001

#define _RPINR13_FLTA2R1_POSITION                0x00000001
#define _RPINR13_FLTA2R1_MASK                    0x00000002
#define _RPINR13_FLTA2R1_LENGTH                  0x00000001

#define _RPINR13_FLTA2R2_POSITION                0x00000002
#define _RPINR13_FLTA2R2_MASK                    0x00000004
#define _RPINR13_FLTA2R2_LENGTH                  0x00000001

#define _RPINR13_FLTA2R3_POSITION                0x00000003
#define _RPINR13_FLTA2R3_MASK                    0x00000008
#define _RPINR13_FLTA2R3_LENGTH                  0x00000001

#define _RPINR13_FLTA2R4_POSITION                0x00000004
#define _RPINR13_FLTA2R4_MASK                    0x00000010
#define _RPINR13_FLTA2R4_LENGTH                  0x00000001

#define _RPINR14_QEA1R_POSITION                  0x00000000
#define _RPINR14_QEA1R_MASK                      0x0000001F
#define _RPINR14_QEA1R_LENGTH                    0x00000005

#define _RPINR14_QEB1R_POSITION                  0x00000008
#define _RPINR14_QEB1R_MASK                      0x00001F00
#define _RPINR14_QEB1R_LENGTH                    0x00000005

#define _RPINR14_QEA1R0_POSITION                 0x00000000
#define _RPINR14_QEA1R0_MASK                     0x00000001
#define _RPINR14_QEA1R0_LENGTH                   0x00000001

#define _RPINR14_QEA1R1_POSITION                 0x00000001
#define _RPINR14_QEA1R1_MASK                     0x00000002
#define _RPINR14_QEA1R1_LENGTH                   0x00000001

#define _RPINR14_QEA1R2_POSITION                 0x00000002
#define _RPINR14_QEA1R2_MASK                     0x00000004
#define _RPINR14_QEA1R2_LENGTH                   0x00000001

#define _RPINR14_QEA1R3_POSITION                 0x00000003
#define _RPINR14_QEA1R3_MASK                     0x00000008
#define _RPINR14_QEA1R3_LENGTH                   0x00000001

#define _RPINR14_QEA1R4_POSITION                 0x00000004
#define _RPINR14_QEA1R4_MASK                     0x00000010
#define _RPINR14_QEA1R4_LENGTH                   0x00000001

#define _RPINR14_QEB1R0_POSITION                 0x00000008
#define _RPINR14_QEB1R0_MASK                     0x00000100
#define _RPINR14_QEB1R0_LENGTH                   0x00000001

#define _RPINR14_QEB1R1_POSITION                 0x00000009
#define _RPINR14_QEB1R1_MASK                     0x00000200
#define _RPINR14_QEB1R1_LENGTH                   0x00000001

#define _RPINR14_QEB1R2_POSITION                 0x0000000A
#define _RPINR14_QEB1R2_MASK                     0x00000400
#define _RPINR14_QEB1R2_LENGTH                   0x00000001

#define _RPINR14_QEB1R3_POSITION                 0x0000000B
#define _RPINR14_QEB1R3_MASK                     0x00000800
#define _RPINR14_QEB1R3_LENGTH                   0x00000001

#define _RPINR14_QEB1R4_POSITION                 0x0000000C
#define _RPINR14_QEB1R4_MASK                     0x00001000
#define _RPINR14_QEB1R4_LENGTH                   0x00000001

#define _RPINR15_INDX1R_POSITION                 0x00000000
#define _RPINR15_INDX1R_MASK                     0x0000001F
#define _RPINR15_INDX1R_LENGTH                   0x00000005

#define _RPINR15_INDX1R0_POSITION                0x00000000
#define _RPINR15_INDX1R0_MASK                    0x00000001
#define _RPINR15_INDX1R0_LENGTH                  0x00000001

#define _RPINR15_INDX1R1_POSITION                0x00000001
#define _RPINR15_INDX1R1_MASK                    0x00000002
#define _RPINR15_INDX1R1_LENGTH                  0x00000001

#define _RPINR15_INDX1R2_POSITION                0x00000002
#define _RPINR15_INDX1R2_MASK                    0x00000004
#define _RPINR15_INDX1R2_LENGTH                  0x00000001

#define _RPINR15_INDX1R3_POSITION                0x00000003
#define _RPINR15_INDX1R3_MASK                    0x00000008
#define _RPINR15_INDX1R3_LENGTH                  0x00000001

#define _RPINR15_INDX1R4_POSITION                0x00000004
#define _RPINR15_INDX1R4_MASK                    0x00000010
#define _RPINR15_INDX1R4_LENGTH                  0x00000001

#define _RPINR18_U1RXR_POSITION                  0x00000000
#define _RPINR18_U1RXR_MASK                      0x0000001F
#define _RPINR18_U1RXR_LENGTH                    0x00000005

